Tekla.Structures.ModelInternal.dotPolygon_t
Serialization structure for Polygon.

Tekla.Structures.ModelInternal.dotPolygon_t.nPoints
Number of cornerpoints in polygon.

Tekla.Structures.ModelInternal.dotPolygon_t.aX
The x-coordinates of all points.

Tekla.Structures.ModelInternal.dotPolygon_t.aY
The y-coordinates of all points.

Tekla.Structures.ModelInternal.dotPolygon_t.aZ
The z-coordinates of all points.

Tekla.Structures.ModelInternal.dotPolygon_t.#ctor(System.Int32)
Instantiates a polygon structure with given arguments.
Size: Number of points in polygon.

Tekla.Structures.ModelInternal.dotPolygon_t.GetPoints
Get polygon points in ArrayList.
Returns: ArrayList of polygon Points